## This is a functional constraint SDC file
set_case_analysis 0 [get_ports SE]
# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.10-p002_1 on Mon Mar 31 15:00:42 BST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design Row_encoder_10P

create_clock -name "CLK" -period 25.0 -waveform {0.0 12.5} [get_ports clk]
set_load -pin_load 0.4 [get_ports {encoded_data[31]}]
set_load -pin_load 0.4 [get_ports {encoded_data[30]}]
set_load -pin_load 0.4 [get_ports {encoded_data[29]}]
set_load -pin_load 0.4 [get_ports {encoded_data[28]}]
set_load -pin_load 0.4 [get_ports {encoded_data[27]}]
set_load -pin_load 0.4 [get_ports {encoded_data[26]}]
set_load -pin_load 0.4 [get_ports {encoded_data[25]}]
set_load -pin_load 0.4 [get_ports {encoded_data[24]}]
set_load -pin_load 0.4 [get_ports {encoded_data[23]}]
set_load -pin_load 0.4 [get_ports {encoded_data[22]}]
set_load -pin_load 0.4 [get_ports {encoded_data[21]}]
set_load -pin_load 0.4 [get_ports {encoded_data[20]}]
set_load -pin_load 0.4 [get_ports {encoded_data[19]}]
set_load -pin_load 0.4 [get_ports {encoded_data[18]}]
set_load -pin_load 0.4 [get_ports {encoded_data[17]}]
set_load -pin_load 0.4 [get_ports {encoded_data[16]}]
set_load -pin_load 0.4 [get_ports {encoded_data[15]}]
set_load -pin_load 0.4 [get_ports {encoded_data[14]}]
set_load -pin_load 0.4 [get_ports {encoded_data[13]}]
set_load -pin_load 0.4 [get_ports {encoded_data[12]}]
set_load -pin_load 0.4 [get_ports {encoded_data[11]}]
set_load -pin_load 0.4 [get_ports {encoded_data[10]}]
set_load -pin_load 0.4 [get_ports {encoded_data[9]}]
set_load -pin_load 0.4 [get_ports {encoded_data[8]}]
set_load -pin_load 0.4 [get_ports {encoded_data[7]}]
set_load -pin_load 0.4 [get_ports {encoded_data[6]}]
set_load -pin_load 0.4 [get_ports {encoded_data[5]}]
set_load -pin_load 0.4 [get_ports {encoded_data[4]}]
set_load -pin_load 0.4 [get_ports {encoded_data[3]}]
set_load -pin_load 0.4 [get_ports {encoded_data[2]}]
set_load -pin_load 0.4 [get_ports {encoded_data[1]}]
set_load -pin_load 0.4 [get_ports {encoded_data[0]}]
set_load -pin_load 0.4 [get_ports data_ready]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports rst_n]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports data_valid]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[29]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[28]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[27]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[26]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[25]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[24]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[23]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[22]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[21]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[20]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[19]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[18]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[17]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[16]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[15]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[14]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[13]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[12]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[11]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[10]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[9]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[8]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[29]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[28]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[27]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[26]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[25]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[24]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[23]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[22]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[21]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[20]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[19]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[18]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[17]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[16]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[15]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[14]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[13]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[12]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[11]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[10]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[9]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[8]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[31]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[30]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[29]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[28]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[27]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[26]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[25]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[24]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[23]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[22]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[21]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[20]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[19]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[18]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[17]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[16]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[15]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[14]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[13]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[12]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[11]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[10]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[9]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[8]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports data_ready]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports clk]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports rst_n]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports data_valid]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[29]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[28]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[27]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[26]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[25]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[24]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[23]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[22]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[21]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[20]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[19]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[18]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[17]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[16]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[15]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[14]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[13]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[12]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[11]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[10]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[9]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[8]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[7]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[6]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[5]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[4]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[3]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[2]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[1]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[0]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[29]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[28]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[27]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[26]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[25]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[24]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[23]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[22]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[21]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[20]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[19]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[18]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[17]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[16]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[15]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[14]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[13]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[12]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[11]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[10]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[9]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[8]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[7]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[6]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[5]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[4]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[3]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[2]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[1]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[0]}]
#set_ideal_network -no_propagate [get_nets rst_n]
set_clock_latency  2.5 [get_clocks CLK]
set_clock_uncertainty -setup 2.5 [get_clocks CLK]
set_clock_uncertainty -hold 0.3 [get_clocks CLK]
