# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.10-p002_1 on Thu Mar 20 12:40:14 GMT 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design Row_encoder_5P

set_case_analysis 0 [get_ports SE]
create_clock -name "CLK" -period 25.0 -waveform {0.0 12.5} [get_ports clk]
set_load -pin_load 0.4 [get_ports {encoded_data[15]}]
set_load -pin_load 0.4 [get_ports {encoded_data[14]}]
set_load -pin_load 0.4 [get_ports {encoded_data[13]}]
set_load -pin_load 0.4 [get_ports {encoded_data[12]}]
set_load -pin_load 0.4 [get_ports {encoded_data[11]}]
set_load -pin_load 0.4 [get_ports {encoded_data[10]}]
set_load -pin_load 0.4 [get_ports {encoded_data[9]}]
set_load -pin_load 0.4 [get_ports {encoded_data[8]}]
set_load -pin_load 0.4 [get_ports {encoded_data[7]}]
set_load -pin_load 0.4 [get_ports {encoded_data[6]}]
set_load -pin_load 0.4 [get_ports {encoded_data[5]}]
set_load -pin_load 0.4 [get_ports {encoded_data[4]}]
set_load -pin_load 0.4 [get_ports {encoded_data[3]}]
set_load -pin_load 0.4 [get_ports {encoded_data[2]}]
set_load -pin_load 0.4 [get_ports {encoded_data[1]}]
set_load -pin_load 0.4 [get_ports {encoded_data[0]}]
set_load -pin_load 0.4 [get_ports data_ready]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports rst_n]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports data_valid]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[14]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[13]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[12]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[11]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[10]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[9]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[8]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {pixel_in[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[44]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[43]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[42]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[41]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[40]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[39]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[38]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[37]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[36]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[35]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[34]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[33]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[32]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[31]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[30]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[29]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[28]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[27]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[26]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[25]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[24]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[23]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[22]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[21]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[20]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[19]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[18]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[17]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[16]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[15]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[14]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[13]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[12]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[11]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[10]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[9]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[8]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {tik_tok[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[15]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[14]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[13]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[12]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[11]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[10]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[9]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[8]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports {encoded_data[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 6.25 [get_ports data_ready]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports clk]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports rst_n]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports data_valid]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[14]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[13]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[12]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[11]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[10]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[9]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[8]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[7]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[6]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[5]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[4]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[3]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[2]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[1]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {pixel_in[0]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[44]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[43]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[42]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[41]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[40]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[39]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[38]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[37]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[36]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[35]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[34]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[33]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[32]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[31]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[30]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[29]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[28]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[27]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[26]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[25]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[24]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[23]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[22]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[21]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[20]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[19]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[18]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[17]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[16]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[15]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[14]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[13]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[12]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[11]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[10]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[9]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[8]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[7]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[6]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[5]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[4]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[3]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[2]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[1]}]
set_driving_cell -lib_cell INHDX1 -library D_CELLS_HD_LPMOS_slow_1_62V_125C -pin "Q" [get_ports {tik_tok[0]}]
#set_ideal_network -no_propagate [get_nets rst_n]
set_clock_latency  2.5 [get_clocks CLK]
set_clock_uncertainty -setup 2.5 [get_clocks CLK]
set_clock_uncertainty -hold 0.3 [get_clocks CLK]

# Ignore test signals in functional mode
set_false_path -from [get_ports SE]  
set_false_path -from [get_ports scan_in]  
set_false_path -to   [get_ports scan_out]

